{"color":"YELLOW","isTrashed":false,"isPinned":false,"isArchived":false,"textContent":"“I want to share something that’s been on my mind, even though it’s not fully clear to me yet. I feel a lot of mixed emotions about it, and I want to take responsibility for my part in this dynamic. I know that what I’m sharing may be difficult, and I’m open to hearing your feelings as well. I just want to be honest with you and with myself, and I appreciate you hearing me out as I work through it.”\n\nHello Arielle, I hope you are having a lovely day with your family - mom, sister, neice. Tha your mom's singing filled you up and showered you all with her passion and love. \n\nWhen we talked yesterday you called out a few things you were sensing in me. I wanted to circle back to these comments and share with you where I am at. I want to share this with you because where I am at affects our field. Because I love and care about you. Because I respect you. And because you deserve to know what's going on in me so you can have data for your own sense making process. \n\nHeadline: I am having a moment of confronting a deeply held insecurity - confronting the strategy I've used to hide - and confronting how this is impacting my own ability to get clear on what I want. \n\nMy fear in sharing is that being mid process and not yet fully clear, this sharing will be interpreted as fixed and unchangeable thoughts and feelings. That permanent decisions will be made based on an impermenent understanding of what I am feeling and experiencing. And that those decisions would result in you pulling away and exiting what we have built. \nI don't have a clear answer yet on what I want or how to get it. I am only getting clearler on the place I am coming from. \n\nUp until Saturday, I was more and more certain, up to totally certain, that I wanted to leave my marriage. That doing so was right for me, neccessary for my healing journey, and would open me up to the life I have always envisioned. This still might be the right path for me, but, now the reasons I have told myself for leaving no longer feel grounded in unbiased understanding of what I need and want. \n\nAs best I can tell this started after feeling overwhelmed on Friday and continued into Saturday as I spent the day learning about trauma bonding. What moved into the front of my mind was this: that my deepest insecurities might actually be the major contributor to the challenges I am now facing in my marriage and all the relationships I have had. That this insecurity still rears its head in our field. That this deepest insecurity is so much a part of my thinking that everything I want is focused on alleviating this insecurity. The painful truth feels like I have made Gil the problem and you the solution. The even more painful truth is that left unchecked, making any decisions from this place no longer feels like a solid foundation. \n\nAnd so I am having somewhat of a freakout moment. A moment of self awareness that is giving me pause on being so decisive on what I want in life. What I've learned is that the decisions I have made, which I beleive are being made, in part, to alleviate this unhealed insecurity, are creating more harm and more damage to myself and the people in my life. And so right now I need to stop being decisive and focus on understanding what I need and want. \n\nWhat I am realizing is that my deepest insecurity is that I am inherently unlovable for just being me. That by myself I am nothing - not interesting, not  worthy of love. What I am realizing is that nearly everything in my life has been focused on finding my sense of worth from external sources. Namely, what I do for people. And that by playing a role, rising to an expectation, going above and beyond, solving a problem, doing work, etc, etc, etc. that I will then be worthy of love. \n\nWhat is nagging the back of my mind and the corner of my heart, is that this deepest insecurity has overshaddowed why everything in my life is breaking now. \n\nFirst, I am pouring myself into work because it has been my #1 strategy for being worthy. However, this has been the trap my whole life. Everything has either been helping me accomplish this or getting in the way. It's why I keep investing in the Chamber. It's why I quit each job after 3 years, to take on a bigger position with more status even before I was ready for the role. This is truly why I failed out of Wonderstate. Because I wasn't there for the team. I was there for me. Caleb and TJ just mirror that back to me. \n\nSecond, I have sought validation, admiration, and attention from anyone driving me to cast a wide net but with no real deep and lasting friendships or relationships. I am great at starting a conversation but bad at investing in it. Why? Because the relationship was really about me. It wasn't about them. \n\nThird, I brough this into my marriage and my family. I deprioritized their needs over attending to work or relationships that were going to get me validation. Craving validation. And when it came to sitting with them and focusing on them, I didn't. This really hurts to admist. \n\nFourth, I didn't treat Gil with love. I stopped trying to learn who she way. I stopped focusing on her needs. I stopped paying attention. All because my work was so important. \n\nFifth, I didn't treat Ben with love. I didn't pay attention to him when he needed me to. I deprioritized his needs, his wants, and his accomplishments. I was always busy, too busy to play with him. This carried over into Winston too. \n\nSixth, I have ignored boundaries being broken, and allowed myself to build shared intimacy with you too fast and unfairly to you because I can't commit to hold it until other circumstances change in my life. You helped me, from the very beginning, see myself in a way I haven't before. And, because together you and I can accomplish anything, you help me accomplish work that fills the hole in my self worth. \n\nNow I am realizing everythign that happens in the future is depends on me getting real about my healing and real about learning how to love myself. Until I do this, I will continue to repeat the real pattern of focusing on external validaton, misstreating people around me, and living a life built on an external sense of worth. I can't do that anymore. It's wrong and it's ultimately creating harm in me and everyone I work with. \n\nIn order to love myself I need to act with congruance in my most deeply held values. When I do this, I know I am worthy of my own love. When I don't I feel myself wanting this love more and more from others. This is the trap I feel I am in. \n\nI believe in the power of committment. I beleive in the importance of a whole family for the wellbeing of all. And I believe in giving something this important every last drop of effort, until there is no possible way forward. Right now, realizing that a big part of the reason why my relationship is broken is because of me, I am realizing that there is still a possibility that I can work through it and have a love filled healthy relationship with Gil and my kids. As long as this possibility exists, I can't in good concious, exit the relationship until I know for sure it's not right. This means I have to confront my own demons and do so intentionally and intimately with Gil. \n\nI believe in the power of our field. I believe in the importance of the middle way. And I believe healthy relationships are built with healthy relationships. Right now, I know that I can't continue with the open boundaries, intimacy, and connection we have shared. And, I know that if I stay with Gil that more boundaries will be needed and not honoring those boundaries will risk the integrity of our relationship. I would have no honor to continue in the way we have and keeping my self respect is important for building my self love. I do believe in what we are building with Purpsoe Trust Partners and our theory of change. I want to come back to grounding our relationship in the purpose of building PTP. \n\nI believe that wisdom is coming through me and that this journey to self love, and the cooresponding consequences is the last frontier of my personal growth edge. The edge I should have started with, but now know needs to be built. Until I am clear on the place I am coming from is rooted in grounded self love, and values that I commit to stand by, I need to move forward from here. \n\nAaron\n\n\nThis weekend has been a multitude of memories coming back around how I have acted from this place and continue to act from this place. Now I need to unpack this. I need to unpack what I need and want I want at my core. I need to think more deeply about the values I feel in my heart that I won't compromise for anything or anyone. I need to be more aware of how this deeply hidden insecurity may be trying to use everyone else to heal it. However,  I am clear on the fact that it's no one else's responsibilty but mine. I'm accountable for who I am and what I need. Writing this is a step towards taking accountability. A step towards naming and holding the feeling of being worthless with tenderness. \n\nNow becoming aware of this I am also becoming aware of implications for our field. I can feel that the more times I share the messy oscilation of feelings the less it is helping our field. In fact, hot and cold was actually a pattern that creates trauma in the first place (I just learned). This preventable trauma is something I feel is really important to keep out of our field. Given that you have shared you're clear on what you want I know the responsibility is mine to get clear on what I want, communicate this and live into it. To do this I need to: \n\n1. Work through my trauma and insecurity rooted in myself. This isn't solving my trauma. Rather, it's relentlessly checking myself against my insecurity. \n2. I need to Work through my relationship with Gil and my kids. \n\n\nthrough my relationship with Gil. This is something I need to do with her. I need to\n\nFirst, I feel it's important to come back to the purpose that brought us together: working together to create and realize our theory of change in the world. \nSecond, \n\nI feel its important to not talk about my marriage until I get clear on where it stands. \n\na clear decision has been reached. I also feel it's important to focus on continuing to re-establish safety and trust and let this drive how we come together. I would really like to know and understand from you what you feel you need in this moment. At the end of the day I hold my committment to get clear on what I want, communicate what I want, and live into what I want. And, as this affects our field, co-create with you a path forward. \n\nI am here to receive what is alive in you in any way you feel you want to express. \n\nAA\n\n\n\n\n////\n////\n////\n\n\nI can no longer say with certainy that what I want is to leave my marriage. That doing so is right for me, neccesary for my healing journey, and will open me up for the life I have always envisioned. I can no longer say with certainty it is what would be best for our partnership, our work and our field. Yet Friday it was certain. \n\nWhat I feel clear on is that I have brought you into my personal relationship field as one still exists with Gil. I feel shame and guilt around this. Shame that I opened myself up in this way so quickly, without realizing how much up and down emotional turmolt there would be. I feelt guilty in knowing this hurts. \n\nI keep coming back to the truth that I can't escape from. That truth is this. I need to decide what I want. I need to learn to speak this clearly. And then I need to learn to live with it. \n\nWhat I want is to be loved. What I realize I am doing is looking for love outside of myself. And that doing so I am actually hiding from the feeling that I don't love myself. And that only through validation externally can I feel worthy. \n\nAs I have felt more and more certain that leaving my marriage is right for me, I have oppened myself up more and more to you and you have opened yourself up more and more to me. I don't regret for a second any conversation, or experience we have shared together. Each experience has been profoundly powerful in its own way. The experience has been real, honest and true. \n\nSo what has changed? \n\nUp until Saturday, I've been more and more certain that our partnership is right for me, necessary for my healing journey, and is opening me up to the life I have always envisioned. \n\nAnd up until Saturday, I have been fairly certain that a meaningful career, one that is solving a meaningful problem that is needed by the world, is the way to feel worthy. To feel like I haven't fucked up my life. To feel like all of my career focused choices will be validated, because I've accomplished the goal. \n\nWhat I realized on Saturday has \n\nAs certainty has increased I've opened myself up to you more and more. And in doing so I'm afraid I've fallen into the very issue I'm running from. \n\nBut what I am realizing is that running from my marriage, and running towards a new relationship, is actually me running from confronting the unhealed trauma in my past. The trauma that has affected my sense of self identity, self worth and self love. \n\nI have increasingly made Gil out to be an incompatible partner for me as I have focused on my #1 strategy for developing self worth: proving myself with a successful career. I have increasingly made you into the only one who can help me find my self worth through our partnership in our work. \n\nMy forumla to feel good about myself is actually happening. Build a meaningful career first. Prove I'm worthy of love. Then put my attention towards building a balanced and holistic life. \n\nReading about trauma and trauma bonding this weekend put into focus \n\nThis weekend has been a confrontation of the unhealed trauma in my past. At the root is a feeling of unworthiness. Over time I have poured myself into anything and everything and everyone that helps me feel worthy. And, in doing so I have relied on the work I am doing and the people around me to fill up my cup. But I have never actually acknowledged this feeling in myself. Thinking that I might have unhealed trauma has been overwhelming because it will just get in the way of the work and relationships that are validating me. \n\nThis weekend I started researching trauma and trauma bonding in relationships. It was easy for me to read this and say, oh yeah that's created the problem in my marriage, but it isn't my trauma. It's her trauma. And because she isn't taking responsibility for her trauma, I'm in the right to move on. But the feeling started to take root that actually it's my trauma. \n\nThe biggest trauma was having Ben out of wedlock. \n\n","title":"Reflection","userEditedTimestampUsec":1730248650234000,"createdTimestampUsec":1730059348304000,"textContentHtml":"<p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">&ldquo;I want to share something that&rsquo;s been on my mind, even though it&rsquo;s not fully clear to me yet. I feel a lot of mixed emotions about it, and I want to take responsibility for my part in this dynamic. I know that what I&rsquo;m sharing may be difficult, and I&rsquo;m open to hearing your feelings as well. I just want to be honest with you and with myself, and I appreciate you hearing me out as I work through it.&rdquo;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Hello Arielle, I hope you are having a lovely day with your family - mom, sister, neice. Tha your mom's singing filled you up and showered you all with her passion and love.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">When we talked yesterday you called out a few things you were sensing in me. I wanted to circle back to these comments and share with you where I am at. I want to share this with you because where I am at affects our field. Because I love and care about you. Because I respect you. And because you deserve to know what's going on in me so you can have data for your own sense making process.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Headline: I am having a moment of confronting a deeply held insecurity - confronting the strategy I've used to hide - and confronting how this is impacting my own ability to get clear on what I want.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">My fear in sharing is that being mid process and not yet fully clear, this sharing will be interpreted as fixed and unchangeable thoughts and feelings. That permanent decisions will be made based on an impermenent understanding of what I am feeling and experiencing. And that those decisions would result in you pulling away and exiting what we have built.&nbsp;<\/span><\/p><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">I don't have a clear answer yet on what I want or how to get it. I am only getting clearler on the place I am coming from.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Up until Saturday, I was more and more certain, up to totally certain, that I wanted to leave my marriage. That doing so was right for me, neccessary for my healing journey, and would open me up to the life I have always envisioned. This still might be the right path for me, but, now the reasons I have told myself for leaving no longer feel grounded in unbiased understanding of what I need and want.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">As best I can tell this started after feeling overwhelmed on Friday and continued into Saturday as I spent the day learning about trauma bonding. What moved into the front of my mind was this: that my deepest insecurities might actually be the major contributor to the challenges I am now facing in my marriage and all the relationships I have had. That this insecurity still rears its head in our field. That this deepest insecurity is so much a part of my thinking that everything I want is focused on alleviating this insecurity. The painful truth feels like I have made Gil the problem and you the solution. The even more painful truth is that left unchecked, making any decisions from this place no longer feels like a solid foundation.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">And so I am having somewhat of a freakout moment. A moment of self awareness that is giving me pause on being so decisive on what I want in life. What I've learned is that the decisions I have made, which I beleive are being made, in part, to alleviate this unhealed insecurity, are creating more harm and more damage to myself and the people in my life. And so right now I need to stop being decisive and focus on understanding what I need and want.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">What I am realizing is that my deepest insecurity is that I am inherently unlovable for just being me. That by myself I am nothing - not interesting, not&nbsp; worthy of love. What I am realizing is that nearly everything in my life has been focused on finding my sense of worth from external sources. Namely, what I do for people. And that by playing a role, rising to an expectation, going above and beyond, solving a problem, doing work, etc, etc, etc. that I will then be worthy of love.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">What is nagging the back of my mind and the corner of my heart, is that this deepest insecurity has overshaddowed why everything in my life is breaking now.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">First, I am pouring myself into work because it has been my #1 strategy for being worthy. However, this has been the trap my whole life. Everything has either been helping me accomplish this or getting in the way. It's why I keep investing in the Chamber. It's why I quit each job after 3 years, to take on a bigger position with more status even before I was ready for the role. This is truly why I failed out of Wonderstate. Because I wasn't there for the team. I was there for me. Caleb and TJ just mirror that back to me.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Second, I have sought validation, admiration, and attention from anyone driving me to cast a wide net but with no real deep and lasting friendships or relationships. I am great at starting a conversation but bad at investing in it. Why? Because the relationship was really about me. It wasn't about them.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Third, I brough this into my marriage and my family. I deprioritized their needs over attending to work or relationships that were going to get me validation. Craving validation. And when it came to sitting with them and focusing on them, I didn't. This really hurts to admist.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Fourth, I didn't treat Gil with love. I stopped trying to learn who she way. I stopped focusing on her needs. I stopped paying attention. All because my work was so important.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Fifth, I didn't treat Ben with love. I didn't pay attention to him when he needed me to. I deprioritized his needs, his wants, and his accomplishments. I was always busy, too busy to play with him. This carried over into Winston too.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Sixth, I have ignored boundaries being broken, and allowed myself to build shared intimacy with you too fast and unfairly to you because I can't commit to hold it until other circumstances change in my life. You helped me, from the very beginning, see myself in a way I haven't before. And, because together you and I can accomplish anything, you help me accomplish work that fills the hole in my self worth.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Now I am realizing everythign that happens in the future is depends on me getting real about my healing and real about learning how to love myself. Until I do this, I will continue to repeat the real pattern of focusing on external validaton, misstreating people around me, and living a life built on an external sense of worth. I can't do that anymore. It's wrong and it's ultimately creating harm in me and everyone I work with.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">In order to love myself I need to act with congruance in my most deeply held values. When I do this, I know I am worthy of my own love. When I don't I feel myself wanting this love more and more from others. This is the trap I feel I am in.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">I believe in the power of committment. I beleive in the importance of a whole family for the wellbeing of all. And I believe in giving something this important every last drop of effort, until there is no possible way forward. Right now, realizing that a big part of the reason why my relationship is broken is because of me, I am realizing that there is still a possibility that I can work through it and have a love filled healthy relationship with Gil and my kids. As long as this possibility exists, I can't in good concious, exit the relationship until I know for sure it's not right. This means I have to confront my own demons and do so intentionally and intimately with Gil.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">I believe in the power of our field. I believe in the importance of the middle way. And I believe healthy relationships are built with healthy relationships. Right now, I know that I can't continue with the open boundaries, intimacy, and connection we have shared. And, I know that if I stay with Gil that more boundaries will be needed and not honoring those boundaries will risk the integrity of our relationship. I would have no honor to continue in the way we have and keeping my self respect is important for building my self love. I do believe in what we are building with Purpsoe Trust Partners and our theory of change. I want to come back to grounding our relationship in the purpose of building PTP.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">I believe that wisdom is coming through me and that this journey to self love, and the cooresponding consequences is the last frontier of my personal growth edge. The edge I should have started with, but now know needs to be built. Until I am clear on the place I am coming from is rooted in grounded self love, and values that I commit to stand by, I need to move forward from here.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Aaron<\/span><\/p><br /><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">This weekend has been a multitude of memories coming back around how I have acted from this place and continue to act from this place. Now I need to unpack this. I need to unpack what I need and want I want at my core. I need to think more deeply about the values I feel in my heart that I won't compromise for anything or anyone. I need to be more aware of how this deeply hidden insecurity may be trying to use everyone else to heal it. However,&nbsp; I am clear on the fact that it's no one else's responsibilty but mine. I'm accountable for who I am and what I need. Writing this is a step towards taking accountability. A step towards naming and holding the feeling of being worthless with tenderness.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Now becoming aware of this I am also becoming aware of implications for our field. I can feel that the more times I share the messy oscilation of feelings the less it is helping our field. In fact, hot and cold was actually a pattern that creates trauma in the first place (I just learned). This preventable trauma is something I feel is really important to keep out of our field. Given that you have shared you're clear on what you want I know the responsibility is mine to get clear on what I want, communicate this and live into it. To do this I need to:&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">1. Work through my trauma and insecurity rooted in myself. This isn't solving my trauma. Rather, it's relentlessly checking myself against my insecurity.&nbsp;<\/span><\/p><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">2. I need to Work through my relationship with Gil and my kids.&nbsp;<\/span><\/p><br /><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">through my relationship with Gil. This is something I need to do with her. I need to<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">First, I feel it's important to come back to the purpose that brought us together: working together to create and realize our theory of change in the world.&nbsp;<\/span><\/p><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Second,&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">I feel its important to not talk about my marriage until I get clear on where it stands.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">a clear decision has been reached. I also feel it's important to focus on continuing to re-establish safety and trust and let this drive how we come together. I would really like to know and understand from you what you feel you need in this moment. At the end of the day I hold my committment to get clear on what I want, communicate what I want, and live into what I want. And, as this affects our field, co-create with you a path forward.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">I am here to receive what is alive in you in any way you feel you want to express.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">AA<\/span><\/p><br /><br /><br /><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">////<\/span><\/p><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">////<\/span><\/p><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">////<\/span><\/p><br /><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">I can no longer say with certainy that what I want is to leave my marriage. That doing so is right for me, neccesary for my healing journey, and will open me up for the life I have always envisioned. I can no longer say with certainty it is what would be best for our partnership, our work and our field. Yet Friday it was certain.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">What I feel clear on is that I have brought you into my personal relationship field as one still exists with Gil. I feel shame and guilt around this. Shame that I opened myself up in this way so quickly, without realizing how much up and down emotional turmolt there would be. I feelt guilty in knowing this hurts.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">I keep coming back to the truth that I can't escape from. That truth is this. I need to decide what I want. I need to learn to speak this clearly. And then I need to learn to live with it.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">What I want is to be loved. What I realize I am doing is looking for love outside of myself. And that doing so I am actually hiding from the feeling that I don't love myself. And that only through validation externally can I feel worthy.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">As I have felt more and more certain that leaving my marriage is right for me, I have oppened myself up more and more to you and you have opened yourself up more and more to me. I don't regret for a second any conversation, or experience we have shared together. Each experience has been profoundly powerful in its own way. The experience has been real, honest and true.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">So what has changed?&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Up until Saturday, I've been more and more certain that our partnership is right for me, necessary for my healing journey, and is opening me up to the life I have always envisioned.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">And up until Saturday, I have been fairly certain that a meaningful career, one that is solving a meaningful problem that is needed by the world, is the way to feel worthy. To feel like I haven't fucked up my life. To feel like all of my career focused choices will be validated, because I've accomplished the goal.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">What I realized on Saturday has&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">As certainty has increased I've opened myself up to you more and more. And in doing so I'm afraid I've fallen into the very issue I'm running from.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">But what I am realizing is that running from my marriage, and running towards a new relationship, is actually me running from confronting the unhealed trauma in my past. The trauma that has affected my sense of self identity, self worth and self love.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">I have increasingly made Gil out to be an incompatible partner for me as I have focused on my #1 strategy for developing self worth: proving myself with a successful career. I have increasingly made you into the only one who can help me find my self worth through our partnership in our work.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">My forumla to feel good about myself is actually happening. Build a meaningful career first. Prove I'm worthy of love. Then put my attention towards building a balanced and holistic life.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Reading about trauma and trauma bonding this weekend put into focus&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">This weekend has been a confrontation of the unhealed trauma in my past. At the root is a feeling of unworthiness. Over time I have poured myself into anything and everything and everyone that helps me feel worthy. And, in doing so I have relied on the work I am doing and the people around me to fill up my cup. But I have never actually acknowledged this feeling in myself. Thinking that I might have unhealed trauma has been overwhelming because it will just get in the way of the work and relationships that are validating me.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">This weekend I started researching trauma and trauma bonding in relationships. It was easy for me to read this and say, oh yeah that's created the problem in my marriage, but it isn't my trauma. It's her trauma. And because she isn't taking responsibility for her trauma, I'm in the right to move on. But the feeling started to take root that actually it's my trauma.&nbsp;<\/span><\/p><br /><p dir=\"ltr\" style=\"line-height:1.38;margin-top:0.0pt;margin-bottom:0.0pt;\"><span style=\"font-size:7.2pt;font-family:'Google Sans';color:#000000;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">The biggest trauma was having Ben out of wedlock.&nbsp;<\/span><\/p><br />","labels":[{"name":"Marriage"}]}